# IsLoaded Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationItemFile..::..IsLoaded Method
FabricationItemFile Class See Also
---
Checks to see if the item file has been loaded into the configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public bool IsLoaded()
```

Visual Basic
---
```text
Public Function IsLoaded As Boolean
```

Visual C++
---
```text
public:
bool IsLoaded()
```

# ### Return Value
Returns true if the item file has been loaded into the configuration, false otherwise.
# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace